# 需要安装的包

```
pip install ipython-sql
pip install sqlalchemy
```

对于 mysql，还需要安装

```
pip install PyMySQL
pip install mysqlclient
```

对于postgressql,还需要安装

```
pip install psycopg2
```

In [2]:
# 加载包
%load_ext sql

In [3]:
# 链接数据库
%sql mysql+mysqldb://root:root@localhost/sakila

# %sql postgresql://postgres:password123@localhost/dvdrental

In [5]:
res= %sql select * from actor;
res2=res.DataFrame()

 * mysql+mysqldb://root:***@localhost/sakila
200 rows affected.

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

In [6]:
res2.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [ ]:
# 查询结果赋值及转换为 data frame

res=%sql select * from film limit 5;
res.DataFrame()
res

In [ ]:
# 变量替换

length_var=90
%sql select * from film where length< :length_var;

In [3]:
%%sql
show databases;

 * mysql+mysqldb://root:***@localhost/sakila
7 rows affected.

[('db8',),
 ('information_schema',),
 ('mysql',),
 ('northwind',),
 ('performance_schema',),
 ('sakila',),
 ('sys',)]

In [3]:
%sql use northwind;

 * mysql+mysqldb://root:***@localhost/sakila
0 rows affected.

[]

In [4]:
%sql show tables;

 * mysql+mysqldb://root:***@localhost/sakila
29 rows affected.

[('alphabetical list of products',),
 ('categories',),
 ('category sales for 1997',),
 ('current product list',),
 ('customer and suppliers by city',),
 ('customercustomerdemo',),
 ('customerdemographics',),
 ('customers',),
 ('employees',),
 ('employeeterritories',),
 ('invoices',),
 ('order details',),
 ('order details extended',),
 ('order subtotals',),
 ('orders',),
 ('orders qry',),
 ('product sales for 1997',),
 ('products',),
 ('products above average price',),
 ('products by category',),
 ('quarterly orders',),
 ('region',),
 ('sales by category',),
 ('sales totals by amount',),
 ('shippers',),
 ('summary of sales by quarter',),
 ('summary of sales by year',),
 ('suppliers',),
 ('territories',)]

In [7]:
%sql select * from customers limit 20;

 * mysql+mysqldb://root:***@localhost/sakila
20 rows affected.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', None, '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitucin 2222', 'Mxico D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquera', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'Mxico D.F.', None, '05023', 'Mexico', '(5) 555-3932', None),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', None, 'WA1 1DP', 'UK', '(171) 555-7788', '(171) 555-6750'),
 ('BERGS', 'Berglunds snabbkp', 'Christina Berglund', 'Order Administrator', 'Berguvsvgen  8', 'Lule', None, 'S-958 22', 'Sweden', '0921-12 34 65', '0921-12 34 67'),
 ('BLAUS', 'Blauer See Delikatessen', 'Hanna Moos', 'Sales Representative', 'Forsterstr. 57', 'Mannheim', None, '68306', 'Germany', '0621-08460', '0621-08924'),
 ('BLONP', 'Blondesddsl pre et fils', 'Frdrique Citeaux', 'Marketing Manager', '24, place Klber', 'Strasbourg', None, '67000', 'France', '88.60.15.31', '88.60.15.32'),
 ('BOLID', 'Blido Comidas preparadas', 'Martn Sommer', 'Owner', 'C/ Araquil, 67', 'Madrid', None, '28023', 'Spain', '(91) 555 22 82', '(91) 555 91 99'),
 ('BONAP', "Bon app'", 'Laurence Lebihan', 'Owner', '12, rue des Bouchers', 'Marseille', None, '13008', 'France', '91.24.45.40', '91.24.45.41'),
 ('BOTTM', 'Bottom-Dollar Markets', 'Elizabeth Lincoln', 'Accounting Manager', '23 Tsawassen Blvd.', 'Tsawassen', 'BC', 'T2F 8M4', 'Canada', '(604) 555-4729', '(604) 555-3745'),
 ('BSBEV', "B's Beverages", 'Victoria Ashworth', 'Sales Representative', 'Fauntleroy Circus', 'London', None, 'EC2 5NT', 'UK', '(171) 555-1212', None),
 ('CACTU', 'Cactus Comidas para llevar', 'Patricio Simpson', 'Sales Agent', 'Cerrito 333', 'Buenos Aires', None, '1010', 'Argentina', '(1) 135-5555', '(1) 135-4892'),
 ('CENTC', 'Centro comercial Moctezuma', 'Francisco Chang', 'Marketing Manager', 'Sierras de Granada 9993', 'Mxico D.F.', None, '05022', 'Mexico', '(5) 555-3392', '(5) 555-7293'),
 ('CHOPS', 'Chop-suey Chinese', 'Yang Wang', 'Owner', 'Hauptstr. 29', 'Bern', None, '3012', 'Switzerland', '0452-076545', None),
 ('COMMI', 'Comrcio Mineiro', 'Pedro Afonso', 'Sales Associate', 'Av. dos Lusadas, 23', 'Sao Paulo', 'SP', '05432-043', 'Brazil', '(11) 555-7647', None),
 ('CONSH', 'Consolidated Holdings', 'Elizabeth Brown', 'Sales Representative', 'Berkeley Gardens 12  Brewery', 'London', None, 'WX1 6LT', 'UK', '(171) 555-2282', '(171) 555-9199'),
 ('DRACD', 'Drachenblut Delikatessen', 'Sven Ottlieb', 'Order Administrator', 'Walserweg 21', 'Aachen', None, '52066', 'Germany', '0241-039123', '0241-059428'),
 ('DUMON', 'Du monde entier', 'Janine Labrune', 'Owner', '67, rue des Cinquante Otages', 'Nantes', None, '44000', 'France', '40.67.88.88', '40.67.89.89'),
 ('EASTC', 'Eastern Connection', 'Ann Devon', 'Sales Agent', '35 King George', 'London', None, 'WX3 6FW', 'UK', '(171) 555-0297', '(171) 555-3373'),
 ('ERNSH', 'Ernst Handel', 'Roland Mendel', 'Sales Manager', 'Kirchgasse 6', 'Graz', None, '8010', 'Austria', '7675-3425', '7675-3426')]

### ASCII()

- ASCII（）函数返回特定字符的ASCII值
- 如果输入了多个字符，它将只返回第一个字符的值

In [5]:
%sql select CompanyName,ascii(CompanyName) from customers limit 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[('Alfreds Futterkiste', 65),
 ('Ana Trujillo Emparedados y helados', 65),
 ('Antonio Moreno Taquera', 65),
 ('Around the Horn', 65),
 ("B's Beverages", 66),
 ('Berglunds snabbkp', 66),
 ('Blauer See Delikatessen', 66),
 ('Blido Comidas preparadas', 66),
 ('Blondesddsl pre et fils', 66),
 ("Bon app'", 66)]

### char_length() & CHARACTER_LENGTH()

- 返回字符串的长度;
- 两个函数等价

In [6]:
%sql SELECT ContactName,CHAR_LENGTH(ContactName) AS LengthOfName FROM Customers limit 20;

 * mysql+mysqldb://root:***@localhost/sakila
20 rows affected.

[('Maria Anders', 12),
 ('Ana Trujillo', 12),
 ('Antonio Moreno', 14),
 ('Thomas Hardy', 12),
 ('Christina Berglund', 18),
 ('Hanna Moos', 10),
 ('Frdrique Citeaux', 16),
 ('Martn Sommer', 12),
 ('Laurence Lebihan', 16),
 ('Elizabeth Lincoln', 17),
 ('Victoria Ashworth', 17),
 ('Patricio Simpson', 16),
 ('Francisco Chang', 15),
 ('Yang Wang', 9),
 ('Pedro Afonso', 12),
 ('Elizabeth Brown', 15),
 ('Sven Ottlieb', 12),
 ('Janine Labrune', 14),
 ('Ann Devon', 9),
 ('Roland Mendel', 13)]

### concat()

- CONCAT(expression1, expression2, expression3,...)
- 用于拼接字符串
- 如果任何表达式为NULL值，则返回NULL

In [7]:
%sql SELECT Country,city,CONCAT(Country,'+', city) AS Address FROM Customers limit 20;
# %sql SELECT CONCAT(Country,"", city) AS Address FROM Customers limit 20;

 * mysql+mysqldb://root:***@localhost/sakila
20 rows affected.

[('Germany', 'Berlin', 'Germany+Berlin'),
 ('Mexico', 'Mxico D.F.', 'Mexico+Mxico D.F.'),
 ('Mexico', 'Mxico D.F.', 'Mexico+Mxico D.F.'),
 ('UK', 'London', 'UK+London'),
 ('Sweden', 'Lule', 'Sweden+Lule'),
 ('Germany', 'Mannheim', 'Germany+Mannheim'),
 ('France', 'Strasbourg', 'France+Strasbourg'),
 ('Spain', 'Madrid', 'Spain+Madrid'),
 ('France', 'Marseille', 'France+Marseille'),
 ('Canada', 'Tsawassen', 'Canada+Tsawassen'),
 ('UK', 'London', 'UK+London'),
 ('Argentina', 'Buenos Aires', 'Argentina+Buenos Aires'),
 ('Mexico', 'Mxico D.F.', 'Mexico+Mxico D.F.'),
 ('Switzerland', 'Bern', 'Switzerland+Bern'),
 ('Brazil', 'Sao Paulo', 'Brazil+Sao Paulo'),
 ('UK', 'London', 'UK+London'),
 ('Germany', 'Aachen', 'Germany+Aachen'),
 ('France', 'Nantes', 'France+Nantes'),
 ('UK', 'London', 'UK+London'),
 ('Austria', 'Graz', 'Austria+Graz')]

### concat_ws()

- CONCAT_WS(separator, expression1, expression2, expression3,...)
- 将多个表达式相加，并在它们之间添加一个“-”分隔符
- 其中separator是必需的，即在每个表达式之间添加的分隔符。如果分隔符为NULL，则此函数返回NULL。
- 该函数将跳过具有NULL值的表达式

In [8]:
%sql SELECT Country, city,CONCAT_ws('+',Country, city) AS Address FROM Customers limit 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[('Germany', 'Berlin', 'Germany+Berlin'),
 ('Mexico', 'Mxico D.F.', 'Mexico+Mxico D.F.'),
 ('Mexico', 'Mxico D.F.', 'Mexico+Mxico D.F.'),
 ('UK', 'London', 'UK+London'),
 ('Sweden', 'Lule', 'Sweden+Lule'),
 ('Germany', 'Mannheim', 'Germany+Mannheim'),
 ('France', 'Strasbourg', 'France+Strasbourg'),
 ('Spain', 'Madrid', 'Spain+Madrid'),
 ('France', 'Marseille', 'France+Marseille'),
 ('Canada', 'Tsawassen', 'Canada+Tsawassen')]

### field()

- FIELD(value, val1, val2, val3, ...) 返回字符串列表中“q”的索引位置
- 函数返回值列表中某个值的索引位置
- 此函数执行不区分大小写的搜索。
- 注意：如果在值列表中找不到指定的值，此函数将返回0。如果值为NULL，此函数将返回0。

In [10]:
# %sql SELECT FIELD('q', 's', 'q', 'l');
%sql SELECT City,Region,address,FIELD('Lule',City,Region,address),FIELD('Berlin',City,Region,address) from customers limit 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[('Berlin', None, 'Obere Str. 57', 0, 1),
 ('Mxico D.F.', None, 'Avda. de la Constitucin 2222', 0, 0),
 ('Mxico D.F.', None, 'Mataderos  2312', 0, 0),
 ('London', None, '120 Hanover Sq.', 0, 0),
 ('Lule', None, 'Berguvsvgen  8', 1, 0),
 ('Mannheim', None, 'Forsterstr. 57', 0, 0),
 ('Strasbourg', None, '24, place Klber', 0, 0),
 ('Madrid', None, 'C/ Araquil, 67', 0, 0),
 ('Marseille', None, '12, rue des Bouchers', 0, 0),
 ('Tsawassen', 'BC', '23 Tsawassen Blvd.', 0, 0)]

### find_in_set()

- FIND_IN_SET(string, string_list) 在字符串列表string_list中搜索string：
- 函数的作用是返回字符串列表中字符串的位置。
- 如果在string_list中找不到字符串，则此函数返回0
- 如果字符串或字符串列表为NULL，则此函数返回NULL
- 如果string_list是空字符串（“”），则此函数返回0

In [14]:
%%sql 
# SELECT FIND_IN_SET('q', null);
SELECT FIND_IN_SET('q', 'S,q ');
select City,find_in_set('bu',City) from customers limit 15;

 * mysql+mysqldb://root:***@localhost/sakila
1 rows affected.
15 rows affected.

[(None, None),
 (None, None),
 ('Aachen', 0),
 ('Albuquerque', 0),
 ('Anchorage', 0),
 ('Barcelona', 0),
 ('Barquisimeto', 0),
 ('Bergamo', 0),
 ('Berlin', 0),
 ('Bern', 0),
 ('Boise', 0),
 ('Brandenburg', 0),
 ('Brcke', 0),
 ('Bruxelles', 0),
 ('Buenos Aires', 0)]

### format()

- FORMAT(number, decimal_places)
- FORMAT（）函数将数字格式化为类似“#，####，###.##”的格式，四舍五入到指定的小数位数，然后将结果作为字符串返回。
- number:要格式化的数字；decimal_places：数字的小数位数。如果此参数为0，则此函数返回一个没有小数位数的字符串

In [16]:
%%sql 
select UnitPrice,format(UnitPrice,2) as re from products limit 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[(Decimal('18.0000'), '18.00'),
 (Decimal('19.0000'), '19.00'),
 (Decimal('10.0000'), '10.00'),
 (Decimal('22.0000'), '22.00'),
 (Decimal('21.3500'), '21.35'),
 (Decimal('25.0000'), '25.00'),
 (Decimal('30.0000'), '30.00'),
 (Decimal('40.0000'), '40.00'),
 (Decimal('97.0000'), '97.00'),
 (Decimal('31.0000'), '31.00')]

### insert()

- INSERT(string, position, number, string2)
- 该函数在指定位置的字符串中插入一定数量的字符
- string是将要修改的字符串；position是插入字符串的位置；number是要替换的字符数；string2是要插入字符串的字符串
- 如果位置在字符串长度之外，此函数将返回字符串
- 如果数字大于字符串其余部分的长度，则此函数将替换从位置到字符串末尾的字符串

In [15]:
%%sql
select ProductName,insert(ProductName,2,2,'yy') as re 
from products;

 * mysql+mysqldb://root:***@localhost/sakila
77 rows affected.

[('Alice Mutton', 'Ayyce Mutton'),
 ('Aniseed Syrup', 'Ayyseed Syrup'),
 ('Boston Crab Meat', 'Byyton Crab Meat'),
 ('Camembert Pierrot', 'Cyyembert Pierrot'),
 ('Carnarvon Tigers', 'Cyynarvon Tigers'),
 ('Chai', 'Cyyi'),
 ('Chang', 'Cyyng'),
 ('Chartreuse verte', 'Cyyrtreuse verte'),
 ("Chef Anton's Cajun Seasoning", "Cyyf Anton's Cajun Seasoning"),
 ("Chef Anton's Gumbo Mix", "Cyyf Anton's Gumbo Mix"),
 ('Chocolade', 'Cyycolade'),
 ('Cte de Blaye', 'Cyy de Blaye'),
 ('Escargots de Bourgogne', 'Eyyargots de Bourgogne'),
 ('Filo Mix', 'Fyyo Mix'),
 ('Flotemysost', 'Fyytemysost'),
 ('Geitost', 'Gyytost'),
 ('Genen Shouyu', 'Gyyen Shouyu'),
 ('Gnocchi di nonna Alice', 'Gyycchi di nonna Alice'),
 ('Gorgonzola Telino', 'Gyygonzola Telino'),
 ("Grandma's Boysenberry Spread", "Gyyndma's Boysenberry Spread"),
 ('Gravad lax', 'Gyyvad lax'),
 ('Guaran Fantstica', 'Gyyran Fantstica'),
 ('Gudbrandsdalsost', 'Gyybrandsdalsost'),
 ('Gula Malacca', 'Gyya Malacca'),
 ('Gumbr Gummibrchen', 'Gyybr Gummibrchen'),
 ("Gustaf's Knckebrd", "Gyytaf's Knckebrd"),
 ('Ikura', 'Iyyra'),
 ('Inlagd Sill', 'Iyyagd Sill'),
 ('Ipoh Coffee', 'Iyyh Coffee'),
 ("Jack's New England Clam Chowder", "Jyyk's New England Clam Chowder"),
 ('Konbu', 'Kyybu'),
 ('Lakkalikri', 'Lyykalikri'),
 ('Laughing Lumberjack Lager', 'Lyyghing Lumberjack Lager'),
 ('Longlife Tofu', 'Lyyglife Tofu'),
 ('Louisiana Fiery Hot Pepper Sauce', 'Lyyisiana Fiery Hot Pepper Sauce'),
 ('Louisiana Hot Spiced Okra', 'Lyyisiana Hot Spiced Okra'),
 ('Manjimup Dried Apples', 'Myyjimup Dried Apples'),
 ('Mascarpone Fabioli', 'Myycarpone Fabioli'),
 ('Maxilaku', 'Myyilaku'),
 ('Mishi Kobe Niku', 'Myyhi Kobe Niku'),
 ('Mozzarella di Giovanni', 'Myyzarella di Giovanni'),
 ('Nord-Ost Matjeshering', 'Nyyd-Ost Matjeshering'),
 ('Northwoods Cranberry Sauce', 'Nyythwoods Cranberry Sauce'),
 ('NuNuCa Nu-Nougat-Creme', 'NyyuCa Nu-Nougat-Creme'),
 ('Original Frankfurter grne Soe', 'Oyyginal Frankfurter grne Soe'),
 ('Outback Lager', 'Oyyback Lager'),
 ('Pavlova', 'Pyylova'),
 ('Perth Pasties', 'Pyyth Pasties'),
 ('Pt chinois', 'Pyychinois'),
 ('Queso Cabrales', 'Qyyso Cabrales'),
 ('Queso Manchego La Pastora', 'Qyyso Manchego La Pastora'),
 ('Raclette Courdavault', 'Ryylette Courdavault'),
 ('Ravioli Angelo', 'Ryyioli Angelo'),
 ('Rd Kaviar', 'RyyKaviar'),
 ('Rhnbru Klosterbier', 'Ryybru Klosterbier'),
 ('Rogede sild', 'Ryyede sild'),
 ('Rssle Sauerkraut', 'Ryyle Sauerkraut'),
 ('Sasquatch Ale', 'Syyquatch Ale'),
 ('Schoggi Schokolade', 'Syyoggi Schokolade'),
 ('Scottish Longbreads', 'Syyttish Longbreads'),
 ('Singaporean Hokkien Fried Mee', 'Syygaporean Hokkien Fried Mee'),
 ("Sir Rodney's Marmalade", "Syy Rodney's Marmalade"),
 ("Sir Rodney's Scones", "Syy Rodney's Scones"),
 ("Sirop d'rable", "Syyop d'rable"),
 ('Spegesild', 'Syygesild'),
 ('Steeleye Stout', 'Syyeleye Stout'),
 ('Tarte au sucre', 'Tyyte au sucre'),
 ('Teatime Chocolate Biscuits', 'Tyytime Chocolate Biscuits'),
 ('Thringer Rostbratwurst', 'Tyyinger Rostbratwurst'),
 ('Tofu', 'Tyyu'),
 ('Tourtire', 'Tyyrtire'),
 ('Tunnbrd', 'Tyynbrd'),
 ("Uncle Bob's Organic Dried Pears", "Uyyle Bob's Organic Dried Pears"),
 ('Valkoinen suklaa', 'Vyykoinen suklaa'),
 ('Vegie-spread', 'Vyyie-spread'),
 ('Wimmers gute Semmelkndel', 'Wyymers gute Semmelkndel'),
 ('Zaanse koeken', 'Zyynse koeken')]

### instr()

- INSTR(string1, string2)
- string1是将要搜索的字符串；string2是要在字符串1中搜索的字符串，如果找不到string2，返回0
- 该函数返回一个字符串在另一个字符串中第一次出现的位置
- 此函数执行不区分大小写的搜索。

In [19]:
%%sql
select ProductName,instr(ProductName,'e') as low,instr(ProductName,'E') as upper
from products limit 20;

 * mysql+mysqldb://root:***@localhost/sakila
20 rows affected.

[('Alice Mutton', 5, 5),
 ('Aniseed Syrup', 5, 5),
 ('Boston Crab Meat', 14, 14),
 ('Camembert Pierrot', 4, 4),
 ('Carnarvon Tigers', 14, 14),
 ('Chai', 0, 0),
 ('Chang', 0, 0),
 ('Chartreuse verte', 7, 7),
 ("Chef Anton's Cajun Seasoning", 3, 3),
 ("Chef Anton's Gumbo Mix", 3, 3),
 ('Chocolade', 9, 9),
 ('Cte de Blaye', 3, 3),
 ('Escargots de Bourgogne', 1, 1),
 ('Filo Mix', 0, 0),
 ('Flotemysost', 5, 5),
 ('Geitost', 2, 2),
 ('Genen Shouyu', 2, 2),
 ('Gnocchi di nonna Alice', 22, 22),
 ('Gorgonzola Telino', 13, 13),
 ("Grandma's Boysenberry Spread", 15, 15)]

### lcase()

- LCASE(text)
- 该函数的作用是将字符串转换为小写。
- LOWER（）函数效果与LCASE（）相同

In [4]:
%%sql
select ProductName,lcase(ProductName) as low
from products limit 20;

 * mysql+mysqldb://root:***@localhost/sakila
20 rows affected.

[('Alice Mutton', 'alice mutton'),
 ('Aniseed Syrup', 'aniseed syrup'),
 ('Boston Crab Meat', 'boston crab meat'),
 ('Camembert Pierrot', 'camembert pierrot'),
 ('Carnarvon Tigers', 'carnarvon tigers'),
 ('Chai', 'chai'),
 ('Chang', 'chang'),
 ('Chartreuse verte', 'chartreuse verte'),
 ("Chef Anton's Cajun Seasoning", "chef anton's cajun seasoning"),
 ("Chef Anton's Gumbo Mix", "chef anton's gumbo mix"),
 ('Chocolade', 'chocolade'),
 ('Cte de Blaye', 'cte de blaye'),
 ('Escargots de Bourgogne', 'escargots de bourgogne'),
 ('Filo Mix', 'filo mix'),
 ('Flotemysost', 'flotemysost'),
 ('Geitost', 'geitost'),
 ('Genen Shouyu', 'genen shouyu'),
 ('Gnocchi di nonna Alice', 'gnocchi di nonna alice'),
 ('Gorgonzola Telino', 'gorgonzola telino'),
 ("Grandma's Boysenberry Spread", "grandma's boysenberry spread")]

### left()

- LEFT(string, number_of_chars)
- string是要从中提取的字符串；number_of_chars是要提取的字符数。如果此参数大于字符串中的字符数，则此函数将返回字符串
- LEFT（）函数从字符串中提取多个字符（从左起）
- 从右提取是RIGHT（）函数。

In [16]:
%%sql
select ProductName,left(ProductName,3),left(ProductName,20) as le
from products limit 20;

 * mysql+mysqldb://root:***@localhost/sakila
20 rows affected.

[('Alice Mutton', 'Ali', 'Alice Mutton'),
 ('Aniseed Syrup', 'Ani', 'Aniseed Syrup'),
 ('Boston Crab Meat', 'Bos', 'Boston Crab Meat'),
 ('Camembert Pierrot', 'Cam', 'Camembert Pierrot'),
 ('Carnarvon Tigers', 'Car', 'Carnarvon Tigers'),
 ('Chai', 'Cha', 'Chai'),
 ('Chang', 'Cha', 'Chang'),
 ('Chartreuse verte', 'Cha', 'Chartreuse verte'),
 ("Chef Anton's Cajun Seasoning", 'Che', "Chef Anton's Cajun S"),
 ("Chef Anton's Gumbo Mix", 'Che', "Chef Anton's Gumbo M"),
 ('Chocolade', 'Cho', 'Chocolade'),
 ('Cte de Blaye', 'Cte', 'Cte de Blaye'),
 ('Escargots de Bourgogne', 'Esc', 'Escargots de Bourgog'),
 ('Filo Mix', 'Fil', 'Filo Mix'),
 ('Flotemysost', 'Flo', 'Flotemysost'),
 ('Geitost', 'Gei', 'Geitost'),
 ('Genen Shouyu', 'Gen', 'Genen Shouyu'),
 ('Gnocchi di nonna Alice', 'Gno', 'Gnocchi di nonna Ali'),
 ('Gorgonzola Telino', 'Gor', 'Gorgonzola Telino'),
 ("Grandma's Boysenberry Spread", 'Gra', "Grandma's Boysenberr")]

### length()

- LENGTH(string)
- LENGTH（）函数返回字符串的长度（以字节为单位）

In [19]:
%sql SELECT ContactName,LENGTH(ContactName) from Customers limit 20;

 * mysql+mysqldb://root:***@localhost/sakila
20 rows affected.

[('Maria Anders', 12),
 ('Ana Trujillo', 12),
 ('Antonio Moreno', 14),
 ('Thomas Hardy', 12),
 ('Christina Berglund', 18),
 ('Hanna Moos', 10),
 ('Frdrique Citeaux', 16),
 ('Martn Sommer', 12),
 ('Laurence Lebihan', 16),
 ('Elizabeth Lincoln', 17),
 ('Victoria Ashworth', 17),
 ('Patricio Simpson', 16),
 ('Francisco Chang', 15),
 ('Yang Wang', 9),
 ('Pedro Afonso', 12),
 ('Elizabeth Brown', 15),
 ('Sven Ottlieb', 12),
 ('Janine Labrune', 14),
 ('Ann Devon', 9),
 ('Roland Mendel', 13)]

### locate()

- locate(substring,string,start)
- locate函数用于判断字符串substring在字符串string中的位置，start为查找的起始位置，默认值为1

In [ ]:
%sql SELECT LOCATE('i','string');

### lower()

- lower(string)
- lower将字符串string转换为小写

In [ ]:
%sql SELECT LOWER(customerid) FROM customers;

### lpad()

- lpad(string,length,lpad_string)
- lpad函数用于在左边填充字符串。string为要填充的字符串，length为填充完之后的字符串长度，lpad-string为用于填充的字符串

In [ ]:
%sql SELECT LPAD('PLE',5,'AP');

### ltrim()

- ltrim(string)
- lrtim函数用于移除字符串string左侧的空格

In [ ]:
%sql SELECT LTRIM("   STD");

### mid()

- mid(string,start,length)
- mid函数用于返回字符串string中的子字符串，start为起始位置，length为子字符串的长度

In [ ]:
%sql SELECT MID(customerid,1,5) FROM customers;

### position()

- position(substring IN string)
- position函数用于返回字符串substring第一次在字符串string中出现的位置

In [ ]:
%sql SELECT POSITION('A' IN customerid) FROM customers;

### repeat()

- repeat(string,number)
- repeat函数用于将字符串string重复number次

In [ ]:
%sql SELECT REPEAT(customerid,2) FROM customers;

### replace()

- replace(string,old_string,new_string)
- replace函数用于将字符串string中的子字符串old_string替换成new_string

In [ ]:
%sql SELECT REPLACE(customerid,'A','B') FROM customers;

### reverse()

- reverse(string)
- reverse函数用于反转字符串string

In [ ]:
%sql SELECT REVERSE(customerid) FROM customers;

### right()

- right(string,number)
- right函数用于从右边截取字符串string中的子字符串，子字符串的长度为number

In [ ]:
%sql SELECT RIGHT(customerid,3) FROM customers;

### rpad()

- rpad(string,length,rpad_string)
- rpad函数将rpad_string字符串用于填充字符串string，填充完后的字符串长度为length

In [ ]:
%sql SELECT RPAD('APP',2,'LE');

### rtrim()

- rtrim(string)
- rtrim函数用于消除字符串string右边的空白

In [ ]:
%sql SELECT RTRIM('CUSTOMER   ');

### space()

- space(number)
- space用于返回number长度的空格

In [ ]:
%sql SELECT SPACE(10);

### STRCMP()

 - STRCMP(string1,string2)
 - STRCMP用于比较两个字符串的大小。若一样大，则返回0；若string1大，则返回1；否则返回-1

In [4]:
%sql SELECT STRCMP(first_name,last_name) FROM actor LIMIT 5;

 * mysql+mysqldb://root:***@localhost/sakila
5 rows affected.

[(1,), (-1,), (1,), (1,), (-1,)]

### SUBSTR()
 - SUBSTR(string,start,length) 或 SUBSTR(string FROM start FOR length)
 - SUBSTR()函数用于从字符串中提取子字符串（从任意位置开始）
 - 其中start为起始位置，可正可负，如果是正数，此函数将从字符串的开头提取；如果是负数，此函数将从字符串的末尾提取
 - 其中length为子字符串长度，若省略，将返回整个字符串（从起始位置）

In [5]:
%sql SELECT SUBSTR(city,1,3) FROM city LIMIT 5;

 * mysql+mysqldb://root:***@localhost/sakila
5 rows affected.

[('A C',), ('Abh',), ('Abu',), ('Acu',), ('Ada',)]

### SUBSTRING()
 - SUBSTRING(string,start,length) 或 SUBSTRING(string FROM start FOR length)
 - SUBSTRING()用法等同于SUBSTR()和MID()

In [6]:
%sql SELECT SUBSTRING(country FROM 2 FOR 2) FROM country LIMIT 5;

 * mysql+mysqldb://root:***@localhost/sakila
5 rows affected.

[('fg',), ('lg',), ('me',), ('ng',), ('ng',)]

### SUBSTRING_INDEX()
 - SUBSTRING_INDEX(string,delimiter,number)
 - SUBSTRING_INDEX()函数在指定数量的分隔符出现之前返回字符串的子字符串
 - 其中，number是搜索分隔符的次数，可正可负。如果是正数，则此函数将返回分隔符左侧的所有值；如果是负数，则此函数将返回分隔符右侧的所有值

In [10]:
%sql select SUBSTRING_INDEX(email,'.',2) FROM customer LIMIT 5;

 * mysql+mysqldb://root:***@localhost/sakila
5 rows affected.

[('MARY.SMITH@sakilacustomer',),
 ('PATRICIA.JOHNSON@sakilacustomer',),
 ('LINDA.WILLIAMS@sakilacustomer',),
 ('BARBARA.JONES@sakilacustomer',),
 ('ELIZABETH.BROWN@sakilacustomer',)]

### TRIM()

 - TRIM(string)
 - TRIM()函数从字符串中删除前后空格

In [23]:
%sql SELECT TRIM(first_name) FROM actor LIMIT 5;

 * mysql+mysqldb://root:***@localhost/sakila
5 rows affected.

[('PENELOPE',), ('NICK',), ('ED',), ('JENNIFER',), ('JOHNNY',)]

### UCASE()

 - UCASE(text)
 - UCASE()函数用于将字符串转换为大写

In [26]:
%sql SELECT UCASE(city) FROM city LIMIT 5;

 * mysql+mysqldb://root:***@localhost/sakila
5 rows affected.

[('A CORUÑA (LA CORUÑA)',), ('ABHA',), ('ABU DHABI',), ('ACUÑA',), ('ADANA',)]

### UPPER()

 - UPPER(text)
 - UPPER()函数用于将字符串转换为大写

In [27]:
%sql SELECT UPPER(country) FROM country LIMIT 5;

 * mysql+mysqldb://root:***@localhost/sakila
5 rows affected.

[('AFGHANISTAN',),
 ('ALGERIA',),
 ('AMERICAN SAMOA',),
 ('ANGOLA',),
 ('ANGUILLA',)]

### ABS()

 - ABS(number)
 - ABS()函数用于返回一个数的绝对值

In [28]:
%sql SELECT ABS(actor_id) FROM actor LIMIT 5;

 * mysql+mysqldb://root:***@localhost/sakila
5 rows affected.

[(58,), (92,), (182,), (118,), (145,)]

### ACOS()

 - ACOS(number)
 - ACOS()函数用于返回一个数的反余弦，若number不在[-1,1]这个区间，则返回NULL

In [29]:
%sql SELECT ACOS(film_id) FROM film LIMIT 5;

 * mysql+mysqldb://root:***@localhost/sakila
5 rows affected.

[(0.0,), (None,), (None,), (None,), (None,)]

### ASIN()

 - ASIN(number)
 - ASIN()函数用于返回一个数的反正弦，若number不在[-1,1]这个区间，则返回NULL

In [31]:
%sql SELECT ASIN(film_id) FROM film LIMIT 5;

 * mysql+mysqldb://root:***@localhost/sakila
5 rows affected.

[(1.5707963267948966,), (None,), (None,), (None,), (None,)]

### ATAN()

 - ATAN(number) 或 ATAN(a,b)
 - ATAN()函数用于返回一个或两个数的反正切

In [32]:
%sql SELECT ATAN(film_id,language_id) FROM film LIMIT 5;

 * mysql+mysqldb://root:***@localhost/sakila
5 rows affected.

[(0.7853981633974483,),
 (1.1071487177940904,),
 (1.2490457723982544,),
 (1.3258176636680326,),
 (1.373400766945016,)]

### ATAN2()

 - ATAN2(a,b)
 - ATAN2()函数用于返回两个数的反正切

In [35]:
%sql SELECT ATAN(film_id,language_id) FROM film LIMIT 5;

 * mysql+mysqldb://root:***@localhost/sakila
5 rows affected.

[(0.7853981633974483,),
 (1.1071487177940904,),
 (1.2490457723982544,),
 (1.3258176636680326,),
 (1.373400766945016,)]

### AVG()

 - AVG(expression)
 - AVG()函数用于返回表达式的平均值
 - 其中expression可以是字段或公式

In [37]:
%sql SELECT AVG(rental_id) FROM rental;

 * mysql+mysqldb://root:***@localhost/sakila
1 rows affected.

[(Decimal('8025.3715'),)]

### CEIL()
- CEIL(number)
- 参数值number是必填项，数值类型
- CEIL()函数返回大于或等于number的最小整数值
- 等于CEILING()函数

In [6]:
%sql SELECT CEIL(max(amount)) from payment;

 * mysql+mysqldb://root:***@localhost/sakila
1 rows affected.

[(12,)]

### CEILING()
- CEILING(number)
- 参数值number是必填项，为数值类型
- CEILING()函数返回大于或等于number的最小整数值
- 此函数等于CEIL()函数

In [7]:
%sql SELECT CEILING(max(length)) from film;

 * mysql+mysqldb://root:***@localhost/sakila
1 rows affected.

[(185,)]

### COS()
- COS(number)
- 参数值number是必填项，为数值类型
- COS()函数返回number的余弦值

In [9]:
%sql SELECT COS(rental_duration) from film LIMIT 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[(0.960170286650366,),
 (-0.9899924966004454,),
 (0.7539022543433046,),
 (0.28366218546322625,),
 (0.960170286650366,),
 (-0.9899924966004454,),
 (0.960170286650366,),
 (0.960170286650366,),
 (-0.9899924966004454,),
 (0.960170286650366,)]

### COT()
- COT(number)
- 参数number是必填项，为数值类型；如果数字为0，则返回错误或NULL
- COT()函数返回number的余切值

In [10]:
%sql SELECT COT(rental_duration) from film LIMIT 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[(-3.436353004180128,),
 (-7.015252551434534,),
 (1.1475154224051356,),
 (-0.2958129155327455,),
 (-3.436353004180128,),
 (-7.015252551434534,),
 (-3.436353004180128,),
 (-3.436353004180128,),
 (-7.015252551434534,),
 (-3.436353004180128,)]

### COUNT()
- COUNT(expression)
- 参数expression是必填项，为字段或字符串类型
- COUNT()函数返回参数expression的数量，不计算空值

In [11]:
%sql SELECT COUNT(store_id) from inventory where store_id=1;

 * mysql+mysqldb://root:***@localhost/sakila
1 rows affected.

[(2270,)]

### DEGREES()
- DEGREES(number)
- 参数值number是必填项，为数值类型
- DEGREES()函数将弧度值转换为度值：2pi弧度=360度
- RADIANS()将度值转换为弧度值
- PI()返回圆周率的值

In [12]:
%sql SELECT DEGREES(amount) from payment LIMIT 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[(171.31438074411616,),
 (56.7228217179515,),
 (343.2017192833631,),
 (56.7228217179515,),
 (572.3848373356924,),
 (285.9059397702808,),
 (285.9059397702808,),
 (56.7228217179515,),
 (228.6101602571985,),
 (343.2017192833631,)]

### DIV
- x DIV y
- x，y都是必填项；x是被除数，y是除数
- DIV 函数用于整数除，返回整数

In [13]:
%sql SELECT SUM(amount) DIV COUNT(*) from payment GROUP BY staff_id;

 * mysql+mysqldb://root:***@localhost/sakila
2 rows affected.

[(4,), (4,)]

### EXP()
- EXP(number)
- 参数number为必填项
- EXP()函数返回自然常数e的number次幂
- LOG()函数返回指定数字的自然对数
- LN()函数返回数字的自然对数

In [17]:
%sql SELECT EXP(category_id) from film_category ORDER BY film_id LIMIT 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[(403.4287934927351,),
 (59874.14171519782,),
 (403.4287934927351,),
 (59874.14171519782,),
 (2980.9579870417283,),
 (8103.083927575384,),
 (148.4131591025766,),
 (59874.14171519782,),
 (59874.14171519782,),
 (3269017.3724721107,)]

### FLOOR()
- FLOOR(number)
- 参数值number是必填项，为数值类型
- FLOOR()函数返回小于或等于参数值numberd的最大整数值
- CEIL()函数、CEILING()函数返回大于或等于number的最小整数值

In [18]:
%sql SELECT FLOOR(rental_rate) from film LIMIT 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[(0,), (4,), (2,), (2,), (2,), (2,), (4,), (4,), (2,), (4,)]

### GREATEST()
- GREATEST(arg1, arg2, arg3, ...)
- arg1, arg2, arg3, ...是必填项，是要计算的参数列表
- GREATEST()函数返回参数列表的最大值
- LEAST（）函数返回参数列表的最小值
- MINIMUM（）函数返回参数列表的最小值

In [19]:
%sql SELECT GREATEST((SELECT MAX(rental_rate) from film),(SELECT MAX(replacement_cost) from film));

 * mysql+mysqldb://root:***@localhost/sakila
1 rows affected.

[(Decimal('29.99'),)]

### LEAST()
- LEAST(arg1, arg2, arg3, ...)
- arg1, arg2, arg3, ...是必填项，是要计算的参数列表
- LEAST（）函数返回参数列表的最小值
- MINIMUM（）函数返回参数列表的最小值
- GREATEST()函数返回参数列表的最大值

In [20]:
%sql SELECT LEAST((SELECT MIN(rental_rate) from film),(SELECT MIN(replacement_cost) from film));

 * mysql+mysqldb://root:***@localhost/sakila
1 rows affected.

[(Decimal('0.99'),)]

### LN()
- LN(number)
- 参数number为必填项,为大于0的数字
- LN（）函数返回数字number的自然对数
- LOG()函数返回指定数字的自然对数
- EXP()函数返回自然常数e的number次幂

In [21]:
%sql SELECT LN(country_id) from city ORDER BY city_id LIMIT 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[(4.465908118654584,),
 (4.406719247264253,),
 (4.61512051684126,),
 (4.0943445622221,),
 (4.574710978503383,),
 (3.4339872044851463,),
 (4.672828834461906,),
 (3.784189633918261,),
 (3.784189633918261,),
 (3.912023005428146,)]

### LOG()
- LOG(number) 或 LOG(base, number)
- 参数number为必填项，为大于0的数字；base必须大于1
- LOG()函数返回指定数字的自然对数
- LN（）函数返回数字number的自然对数
- EXP()函数返回自然常数e的number次幂

In [22]:
%sql SELECT LOG(country_id) from city ORDER BY city_id LIMIT 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[(4.465908118654584,),
 (4.406719247264253,),
 (4.61512051684126,),
 (4.0943445622221,),
 (4.574710978503383,),
 (3.4339872044851463,),
 (4.672828834461906,),
 (3.784189633918261,),
 (3.784189633918261,),
 (3.912023005428146,)]

### LOG10()
- LOG10(number)
- 参数number为大于0的数字
- LOG10（）函数将参数number的自然对数返回到以10为基数的对数
- LOG()函数返回指定数字的自然对数

In [23]:
%sql SELECT LOG10(country_id) from city ORDER BY city_id LIMIT 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[(1.9395192526186185,),
 (1.9138138523837167,),
 (2.0043213737826426,),
 (1.7781512503836436,),
 (1.9867717342662448,),
 (1.4913616938342726,),
 (2.0293837776852097,),
 (1.6434526764861874,),
 (1.6434526764861874,),
 (1.6989700043360187,)]

### SUM()
- SUM(expression)
- SUM()函数计算一组值的总和。
- 参数值expression是必填项字段或公式
- 注意：空值将被忽略。

In [4]:
%%sql
SELECT SUM(LENGTH) FROM FILM;

 * mysql://root:***@localhost/sakila
1 rows affected.

[(Decimal('115272'),)]

### TAN()
- TAN(number)
- 参数值number是必填项，为数值类型
- TAN()函数返回数字的正切值。

In [5]:
%%sql
SELECT TAN(rental_duration) FROM FILM limit 10;

 * mysql://root:***@localhost/sakila
10 rows affected.

[(-0.29100619138474915,),
 (-0.1425465430742778,),
 (0.8714479827243188,),
 (-3.380515006246586,),
 (-0.29100619138474915,),
 (-0.1425465430742778,),
 (-0.29100619138474915,),
 (-0.29100619138474915,),
 (-0.1425465430742778,),
 (-0.29100619138474915,)]

### TRUNCATE()
- TRUNCATE(number, decimals)
- TRUNCATE()函数将数字截断为指定的小数位数。
- 注意：另请参阅FLOOR()、CEIL()、CEILING()和ROUND()函数。
- 参数值number必填，为要截断的数字；
参数值decimals必填，为要截断的小数位数。

In [6]:
%%sql
SELECT TRUNCATE(amount,1) FROM payment limit 10;

 * mysql://root:***@localhost/sakila
10 rows affected.

[(Decimal('2.9'),),
 (Decimal('0.9'),),
 (Decimal('5.9'),),
 (Decimal('0.9'),),
 (Decimal('9.9'),),
 (Decimal('4.9'),),
 (Decimal('4.9'),),
 (Decimal('0.9'),),
 (Decimal('3.9'),),
 (Decimal('5.9'),)]

### CURRENT_DATE()
- CURRENT_DATE()函数返回当前日期。
- 注意：日期返回为 “YYYY-MM-DD”（字符串）或 YYYYMMDD（数字）。
- 注意：此函数等于CURDATE()函数。

In [7]:
%sql SELECT CURRENT_DATE();

 * mysql://root:***@localhost/sakila
1 rows affected.

[(datetime.date(2023, 8, 11),)]

In [8]:
%sql SELECT CURRENT_DATE() + 1;

 * mysql://root:***@localhost/sakila
1 rows affected.

[(20230812,)]

### CURRENT_TIME()
- CURRENT_TIME()
- CURRENT_TIME()函数返回当前时间。
- 注意：返回时间为 “HH-MM-SS”（字符串）或 HHMMSS.uuuuu（数字）。
- 注意：此函数等于 CURTIME()函数。

In [9]:
%%sql 
SELECT CURRENT_TIME();

 * mysql://root:***@localhost/sakila
1 rows affected.

[(datetime.timedelta(seconds=56839),)]

In [10]:
%%sql 
SELECT CURRENT_TIME()+1;

 * mysql://root:***@localhost/sakila
1 rows affected.

[(154737,)]

### CURRENT_TIMESTAMP()
- CURRENT_TIMESTAMP()
- CURRENT_TIMESTAMP()函数返回当前日期和时间。
- 注意：日期和时间返回为“YYYY-MM-DD HH-MM-SS” （字符串）或YYYYMMDDHHMMSS.uuuuuuuu(numeric)。

In [11]:
%sql SELECT CURRENT_TIMESTAMP();

 * mysql://root:***@localhost/sakila
1 rows affected.

[(datetime.datetime(2023, 8, 11, 15, 47, 57),)]

In [12]:
%sql SELECT CURRENT_TIMESTAMP()+1;

 * mysql://root:***@localhost/sakila
1 rows affected.

[(20230811154807,)]

### CASE
- CASE
    WHEN condition1 THEN result1
    WHEN condition2 THEN result2
    WHEN conditionN THEN resultN
    ELSE result
  END;
-CASE 语句遍历条件，并在满足第一个条件时返回一个值（如 IF-THEN-ELSE 语句）。因此，一旦条件为真，它将停止读取并返回结果。如果没有条件为真，它将返回ELSE 子句中的值。如果没有ELSE部分并且没有条件为真，则返回 NULL。
- 参数condition1, condition2, ...conditionN必填。为条件。评估的顺序与列出的顺序相同。
- 参数result1, result2, ...resultN必填。条件为true时返回值。

In [13]:
%%sql
SELECT film_id,length,
(CASE
    WHEN length > 100 THEN "FIRST"
    WHEN length = 50 THEN "SECOND"
    ELSE "THIRD"
END) AS LEVEL 
FROM film
limit 20;

 * mysql://root:***@localhost/sakila
20 rows affected.

[(1, 86, 'THIRD'),
 (2, 48, 'THIRD'),
 (3, 50, 'SECOND'),
 (4, 117, 'FIRST'),
 (5, 130, 'FIRST'),
 (6, 169, 'FIRST'),
 (7, 62, 'THIRD'),
 (8, 54, 'THIRD'),
 (9, 114, 'FIRST'),
 (10, 63, 'THIRD'),
 (11, 126, 'FIRST'),
 (12, 136, 'FIRST'),
 (13, 150, 'FIRST'),
 (14, 94, 'THIRD'),
 (15, 46, 'THIRD'),
 (16, 180, 'FIRST'),
 (17, 82, 'THIRD'),
 (18, 57, 'THIRD'),
 (19, 113, 'FIRST'),
 (20, 79, 'THIRD')]

### CURRENT_USER()
- CURRENT_USER()
- 函数CURRENT_USER()返回服务器用来验证当前客户端的MySQL帐户的用户名和主机名。
- 结果以UTF8字符的字符串形式返回设置。
- 提示：另请参阅USER()函数。

In [14]:
%sql SELECT CURRENT_USER();

 * mysql://root:***@localhost/sakila
1 rows affected.

[('root@localhost',)]

### DATABASE()
- DATABASE()
- DATABASE()函数返回当前数据库的名称。
- 如果没有当前数据库，此函数返回NULL或""。

In [15]:
%sql SELECT DATABASE();

 * mysql://root:***@localhost/sakila
1 rows affected.

[('sakila',)]

### IF()
- IF(condition, value_if_true, value_if_false)
- IF()函数在条件为TRUE时返回一个值，在条件为FALSE时返回另一个值。
- 参数condition必填，为要测试的值；参数value_if_true必填，条件为TRUE时返回的值；参数value_if_false必填，条件为FALSE时返回的值

In [16]:
%%sql
SELECT payment_id,amount, IF(amount>5, "MORE", "LESS")
FROM payment limit 10;

 * mysql://root:***@localhost/sakila
10 rows affected.

[(1, Decimal('2.99'), 'LESS'),
 (2, Decimal('0.99'), 'LESS'),
 (3, Decimal('5.99'), 'MORE'),
 (4, Decimal('0.99'), 'LESS'),
 (5, Decimal('9.99'), 'MORE'),
 (6, Decimal('4.99'), 'LESS'),
 (7, Decimal('4.99'), 'LESS'),
 (8, Decimal('0.99'), 'LESS'),
 (9, Decimal('3.99'), 'LESS'),
 (10, Decimal('5.99'), 'MORE')]

### IFNULL()
- IFNULL(expression, alt_value)
- 如果表达式为NULL，则 IFNULL()函数返回指定的值。如果表达式不为 NULL，则此函数返回expression。
- 参数expression必填，测试表达式是否为NULL；参数alt_value必填，表达式为NULL时返回的值

In [17]:
%%sql 
SELECT film_id,IFNULL(original_language_id, '1') 
FROM film limit 10;

 * mysql://root:***@localhost/sakila
10 rows affected.

[(1, '1'),
 (2, '1'),
 (3, '1'),
 (4, '1'),
 (5, '1'),
 (6, '1'),
 (7, '1'),
 (8, '1'),
 (9, '1'),
 (10, '1')]

### ISNULL()
- ISNULL(expression)
- ISNULL()函数返回 1 或 0，具体取决于表达式是否为 NULL。
- 如果表达式为 NULL，则此函数返回 1。否则，它将返回 0。

In [18]:
%%sql 
SELECT film_id,ISNULL(original_language_id) 
FROM film limit 10;

 * mysql://root:***@localhost/sakila
10 rows affected.

[(1, 1),
 (2, 1),
 (3, 1),
 (4, 1),
 (5, 1),
 (6, 1),
 (7, 1),
 (8, 1),
 (9, 1),
 (10, 1)]

### NULLIF()
- NULLIF(expr1, expr2)
- NULLIF()函数比较两个表达式，如果它们相等，则返回NULL。否则，将返回第一个表达式。

In [19]:
%%sql
SELECT NULLIF(return_date,last_update)
FROM rental limit 10;

 * mysql://root:***@localhost/sakila
10 rows affected.

[('2005-05-26 22:04:30',),
 ('2005-05-28 19:40:33',),
 ('2005-06-01 22:12:39',),
 ('2005-06-03 01:43:41',),
 ('2005-06-02 04:33:21',),
 ('2005-05-27 01:32:07',),
 ('2005-05-29 20:34:53',),
 ('2005-05-27 23:33:46',),
 ('2005-05-28 00:22:40',),
 ('2005-05-31 22:44:21',)]